
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Менеджер = ПараметрыСеанса.ТекущийПользователь;
	Элементы.ИНН.Видимость = Ложь; 
	Элементы.ЗавершитьСоздание.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНового(Команда)
	
	Элементы.Клиент.Видимость = Ложь;  
	Элементы.ИНН.Видимость = Истина;
	Элементы.СоздатьНового.Видимость = Ложь;  
	Элементы.ЗавершитьСоздание.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСоздание(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ИНН) Тогда
		
		Сообщить("Не заполнен ИНН"); 
		Возврат;
		
	КонецЕсли;   
	
	Если НЕ ЗначениеЗаполнено(Объект.КонтактноеЛицо) ИЛИ НЕ (ЗначениеЗаполнено(Объект.Телефон) ИЛИ ЗначениеЗаполнено(Объект.Почта)) Тогда
		
		Сообщить("Не заполнены контактные данные"); 
		Возврат;
		
	КонецЕсли; 
	
	ЗавершитьСозданиеНаСервере();  
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьСозданиеНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	//Сначала поиск в CRM, контрагент может не отображаться из-за отсутствия договора или ИТС или просто проглядели
	Найденный = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", СокрЛП(Объект.ИНН));
	
	Если Найденный.Пустая() Тогда
		
		//Создание на стороне УТ и выгрузка в CRM
		//Запрос через веб-сервис
		//через контрагента и досье создает нового контрагента и партнера
		//создает и соглашение и договор
		//возвращает структуру с новым партнером  
		Найденный = СоздатьНовогоКонтрагентаВУТ();
		
	КонецЕсли;                                   
	
	ТекущийУровеньИТС = ОбщегоНазначения.ТекущийУровеньИТС(Найденный);
	
	Если НЕ ЗначениеЗаполнено(ТекущийУровеньИТС.Уровень) Тогда //Если нет ИТС и не заполнен вручную, ставим минимальный
		
		КонтрОбъект = Найденный.ПолучитьОбъект();
		КонтрОбъект.УточнениеДоговораИТС = Перечисления.ВидыИТС.ПродажаБезУслуг;
		КонтрОбъект.ДатаУточненияДоговораИТС = ТекущаяДата();
		КонтрОбъект.Записать();
		
	КонецЕсли;     
	
	СпрСотрудник = ПараметрыСеанса.ТекущийПользователь.ПолучитьОбъект();

	Найденные = СпрСотрудник.Доступ.Найти(Найденный, "Контрагент");    
	
	Если Найденные = Неопределено Тогда
		
		Найденные = СпрСотрудник.Доступ.Добавить();
		Найденные.Контрагент = Найденный;
		
	КонецЕсли;   
	
	Найденные.Данные = Истина;
    СпрСотрудник.Записать(); 
	
	Объект.Клиент = Найденный;
	
	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры   

&НаСервере
Функция СоздатьНовогоКонтрагентаВУТ()
	
	АдресВебСервисов = Константы.АдресВебСервисовУТ.Получить();
	
	Если Прав(АдресВебСервисов, 1) = "/" Тогда
		
		АдресВебСервисов = Лев(АдресВебСервисов, СтрДлина(АдресВебСервисов) - 1);
		
	КонецЕсли;
	
	ИмяПользователя = Константы.ИмяПользователяУТ.Получить();
	Пароль 			= Константы.ПарольУТ.Получить();
	
	Определение = Новый WSОпределения(АдресВебСервисов + "/ws/ut_exchange.1cws?wsdl", ИмяПользователя, Пароль);
	
	Прокси = Новый WSПрокси(Определение, "http://www.a-franch.ru", "ut_exchange", "ut_exchangeSoap");
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль 		= Пароль;
	
	ДанныеУТ = Прокси.newkontr(Объект.ИНН, Объект.КонтактноеЛицо, Объект.Телефон, Объект.Почта);		
	
КонецФункции
