
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.Успех, "Принято положительное решение (Успех)");
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.БезИзменений);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.Недозвон);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.НеПланируютПродолжатьСотрудничать);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.НеСостоялось);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.ПретензииПоРаботе);
	ДанныеВыбора.Добавить(Перечисления.РезультатыЗвонка.Провал, "Отрицательное решение (Провал)");
	
	
КонецПроцедуры
