
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Журналирование.ЗаписатьЛог(,,"Форма записи ИТС", НЕ РольДоступна("ДолжностьМенеджерПоПродажам") И НЕ РольДоступна("ДолжностьМенеджерПроектов"));
	
	ДокументыВИТС.Параметры.УстановитьЗначениеПараметра("ПериодИТС",НачалоМесяца(Запись.Период));
	ДокументыВИТС.Параметры.УстановитьЗначениеПараметра("Контрагент",Запись.Контрагент);
	
КонецПроцедуры
