
&НаСервере
Процедура ОтправитьВопросНаСервере()
	
	Если ЗначениеЗаполнено(ВопросИИ) Тогда
		
	    Аутентификация = КоннекторHTTP.НоваяАутентификацияBearer(Токен());
	    Заголовки = Новый Соответствие;
	    Заголовки.Вставить("x-client-id", "");
	    
	    // Определение структуры
	    СтруктураДанных = Новый Структура;
	    СтруктураДанных.Вставить("model", "GigaChat");
	    
	    Сообщения = Новый Массив;
	    
	    СообщениеСистемы = Новый Структура;
	    СообщениеСистемы.Вставить("role", "system");
	    СообщениеСистемы.Вставить("content", "Ты профессиональный маркетолог. Умеешь из короткого названия товара сгенерировать описание. Результат выводишь в виде текста без своих комментариев.");
	    Сообщения.Add(СообщениеСистемы);
	    
	    СообщениеПользователя = Новый Структура;
	    СообщениеПользователя.Вставить("role", "user");
	    СообщениеПользователя.Вставить("content", ВопросИИ);  
	    //СообщениеПользователя.Вставить("attachments", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИДФайла));  
	    
	    
	    Сообщения.Add(СообщениеПользователя);
	    
	    СтруктураДанных.Вставить("messages", Сообщения);
	    
	    // Теперь структура готова к использованию    
	    
	    Результат = КоннекторHTTP.PostJSON("https://gigachat.devices.sberbank.ru/api/v1/chat/completions", СтруктураДанных, Новый Структура("Аутентификация,Заголовки", Аутентификация, Заголовки));
	    ОтветИИ = Результат["choices"][0]["message"]["content"];	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВопрос(Команда)
	
	ОтправитьВопросНаСервере();
	
КонецПроцедуры

&НаСервере
Функция Токен()
    
    Аутентификация = КоннекторHTTP.НоваяАутентификацияBearer("<Authorization key>");

    Данные = Новый Структура("scope", "GIGACHAT_API_PERS");
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("RqUID",XMLСтрока(Новый УникальныйИдентификатор));

    Результат = КоннекторHTTP.КакJSON(КоннекторHTTP.Post("https://ngw.devices.sberbank.ru:9443/api/v2/oauth", Неопределено, Новый Структура("Аутентификация,Заголовки, Данные", Аутентификация, Заголовки, Данные)));
    
    Возврат Результат["access_token"];    
    
КонецФункции